In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [3]:
df = pd.DataFrame([record1, record2, record3], index=['school1', 'school2', 'school1'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [4]:
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [5]:
students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

In [6]:
df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [7]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [8]:
type(df.loc['school2'])

pandas.core.series.Series

In [12]:
df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [14]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [16]:
df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [17]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [18]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [20]:
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [21]:
df.loc['Name']

KeyError: 'Name'

In [22]:
type(df['Name'])

pandas.core.series.Series

In [23]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [24]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [27]:
df.loc[:,['Name','Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [28]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [29]:
df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     82

In [30]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [31]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)

In [32]:
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [33]:
del copy_df['Class']

In [34]:
copy_df

         Score
school1     85
school2     82
school1     90

In [35]:
df['Classranking'] = None

In [36]:
df

          Name      Class  Score Classranking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None

# Practice with some fake data

In [44]:
import pandas as pd
import numpy as np
import faker as F

# Create some fake data
fake = F.Faker()

# Function to create a dataframe with Fake values for our workers
def make_workers(num):
    
    # Lists to randomly assign to workers
    status_list = ['Full time', 'Part Time', 'Per Diem']
    team_list = [fake.color_name() for x in range(4)]
    
    fake_workers = [{'Worker ID':x+1000,
                  'Worker Name':fake.name(), 
                  'Hire Date':fake.date_between(start_date='-30y', end_date='today'),
                  'Worker Status':np.random.choice(status_list, p=[0.50, 0.30, 0.20]), # assign items from list with different probabilities
                  'Team':np.random.choice(team_list)} for x in range(num)]
    
    return fake_workers

worker_df = pd.DataFrame(make_workers(num=5000))
worker_df

      Worker ID       Worker Name   Hire Date Worker Status           Team
0          1000  Jamie Ibarra DVM  1998-06-02      Per Diem  LavenderBlush
1          1001         Karla Cox  2003-06-15     Part Time    LightYellow
2          1002        Karen Nash  1995-09-26     Full time    LightYellow
3          1003     Michael Yates  2007-08-27     Part Time    LightYellow
4          1004    Kathryn Greene  1992-12-26      Per Diem    LightYellow
...         ...               ...         ...           ...            ...
4995       5995     Lori Martinez  2009-01-12      Per Diem    LightYellow
4996       5996    Brandon Little  2017-04-04     Part Time    LightYellow
4997       5997      Michael Reed  1997-05-24     Full time    LightYellow
4998       5998        Kelly Beck  2013-03-10     Full time    LightYellow
4999       5999        Susan Hood  2010-06-14     Full time  LavenderBlush

[5000 rows x 5 columns]

In [45]:
worker_df.head()

   Worker ID       Worker Name   Hire Date Worker Status           Team
0       1000  Jamie Ibarra DVM  1998-06-02      Per Diem  LavenderBlush
1       1001         Karla Cox  2003-06-15     Part Time    LightYellow
2       1002        Karen Nash  1995-09-26     Full time    LightYellow
3       1003     Michael Yates  2007-08-27     Part Time    LightYellow
4       1004    Kathryn Greene  1992-12-26      Per Diem    LightYellow

In [46]:
worker_df.tail()

      Worker ID     Worker Name   Hire Date Worker Status           Team
4995       5995   Lori Martinez  2009-01-12      Per Diem    LightYellow
4996       5996  Brandon Little  2017-04-04     Part Time    LightYellow
4997       5997    Michael Reed  1997-05-24     Full time    LightYellow
4998       5998      Kelly Beck  2013-03-10     Full time    LightYellow
4999       5999      Susan Hood  2010-06-14     Full time  LavenderBlush

In [49]:
worker_df.loc[500]

Worker ID                  1500
Worker Name      Timothy Howard
Hire Date            2015-08-30
Worker Status         Full time
Team                    HotPink
Name: 500, dtype: object

In [51]:
worker_df.loc[np.arange(100, 120)]

     Worker ID         Worker Name   Hire Date Worker Status           Team
100       1100  Dr. William Hughes  1992-03-03     Part Time  LavenderBlush
101       1101          Tara Foley  2021-11-02     Full time          Wheat
102       1102     Stephanie Stone  1995-11-01     Full time          Wheat
103       1103      Brandy Buckley  1997-11-23      Per Diem    LightYellow
104       1104    Jasmine Williams  1999-03-25      Per Diem        HotPink
105       1105     Kathleen Turner  2012-04-26      Per Diem        HotPink
106       1106       Caitlin Myers  2009-11-24     Full time          Wheat
107       1107   Dr. Melissa Dixon  2019-10-13     Full time    LightYellow
108       1108       Robert Walker  2006-05-23      Per Diem          Wheat
109       1109   Cheryl Richardson  2020-06-10     Part Time    LightYellow
110       1110      Anthony Romero  2015-02-05     Full time    LightYellow
111       1111       Michelle Hill  2008-01-23     Part Time  LavenderBlush
112       1112     Ashley Whitaker  2008-11-23      Per Diem  LavenderBlush
113       1113     Dr. Gary Sexton  2009-10-04     Full time  LavenderBlush
114       1114     Andrew Williams  2020-10-20     Full time        HotPink
115       1115    Mr. Brian Snyder  2017-11-02      Per Diem  LavenderBlush
116       1116       Taylor Guerra  1994-07-10     Full time          Wheat
117       1117    Kenneth Martinez  2011-09-07     Full time          Wheat
118       1118         Lori Murphy  2010-04-15      Per Diem    LightYellow
119       1119      Deborah Jordan  2000-02-07     Full time          Wheat

In [61]:
worker_df.loc[np.arange(50, 71)][['Worker Name', 'Worker Status', 'Team']].head()

     Worker Name Worker Status     Team
50  Hannah Perez     Full time  HotPink
51    David Cole     Part Time    Wheat
52  Brian Larson      Per Diem    Wheat
53  Rachel Stark      Per Diem    Wheat
54     Lori Hart     Part Time  HotPink

In [64]:
worker_df.loc[np.arange(50, 71)][['Worker Name', 'Worker Status', 'Team']].head().T

                         50          51            52            53         54
Worker Name    Hannah Perez  David Cole  Brian Larson  Rachel Stark  Lori Hart
Worker Status     Full time   Part Time      Per Diem      Per Diem  Part Time
Team                HotPink       Wheat         Wheat         Wheat    HotPink